#include <stdio.h>

int main() { // จุดเริ่มต้นของโปรแกรม
    // ประกาศตัวแปร กำหนดค่าเริ่มต้น
    int a = 5, b = 17; // ตัวแปร a และ b เป็นจำนวนเต็ม
    float c =  8.5, d = 4.0; // ตัวแปร c และ d เป็นเลขทศนิยม
    // แสดงค่าตัวแปรทั้งหมด
    printf(" a = %d, b = %d, c = %.1f, d = %.1f\n\n", a, b, c, d);
    printf(" d + a = %.1f\n", d + a); // บวกเลข: d + a
    printf(" a - b = %d\n", a - b); // ลบเลข: a - b
    printf(" c * d = %.1f\n", c * d); // คูณเลขทศนิยม: c * d
    printf(" a * c = %.1f\n", a * c); // คูณเลขจำนวนเต็มกับทศนิยม: a * c
    printf(" c / d = %.2f\n", c / d); // หารเลขทศนิยม: c / d
    printf(" b / c = %d\n", b / a); // แปลง b เป็นทศนิยมก่อนหาร: b / c
    printf(" a %% b = %d\n", a % b); // หารเอาเศษ: a % b (ใช้ได้เฉพาะเลขเต็ม)
    printf(" c %% a = %d\n", (int)c % a); // หารเอาเศษของเลขทศนิยม: ทำไม่ได้โดยตรง ต้องแปลงเป็น int ก่อน
    printf(" c %% d = %d\n", (int)c % (int)d); // หารเอาเศษของเลขทศนิยม: ทำไม่ได้โดยตรง ต้องแปลงเป็น int ก่อน

    return 0;
}
/*
    คำอธิบาย:
    - โปรแกรมนี้เริ่มต้นด้วยการประกาศตัวแปร a, b, c, d และกำหนดค่าเริ่มต้นให้
    - จากนั้นจะแสดงค่าตัวแปรทั้งหมด และคำนวณผลลัพธ์ของนิพจน์ต่างๆ เช่น การบวก ลบ คูณ หาร และหารเอาเศษ
    - การหารเอาเศษของเลขทศนิยมจะต้องแปลงเป็นจำนวนเต็มก่อน เนื่องจาก % ใช้ได้เฉพาะกับจำนวนเต็มเท่านั้น
    ทำให้ในบรรทัดที่ 8-10 จะมีการแปลง c และ d เป็น int ก่อนทำการหารเอาเศษ 
*/