#include <stdio.h>

int main() { // จุดเริ่มต้นของโปรแกรม
    // ประกาศตัวแปร กำหนดค่าเริ่มต้น
    double x = 1.0,y = 2.0, z;
    // แสดงค่าตัวแปรเริ่มต้น
    printf("x = %.1f, y = %.1f, z = %.1f\n", x, y, z);

    x = y + 5.0; // คำนวณค่า x ใหม่: x = y + 5.0 = 2.0 + 5.0 = 7.0
    printf("x = %.1f, y = %.1f, z = %.1f\n", x, y, z);

    y = x /  2.0; // คำนวณค่า y ใหม่: y = x / 2.0 = 7.0 / 2.0 = 3.5
    printf("x = %.1f, y = %.1f, z = %.1f\n", x, y, z);

    y = (x*3.0) + 4.0; // คำนวณค่า y ใหม่: y = (x * 3.0) + 4.0 = (7.0 * 3.0) + 4.0 = 21.0 + 4.0 = 25.0
    printf("x = %.1f, y = %.1f, z = %.1f\n", x, y, z);

    x = -0.5 - y; // คำนวณค่า x ใหม่: x = -0.5 - y = -0.5 - 25.0 = -25.5
    printf("x = %.1f, y = %.1f, z = %.1f\n", x, y, z);

    z = x + y; // คำนวณค่า z ใหม่: z = x + y = -25.5 + 25.0 = -0.5
    printf("x = %.1f, y = %.1f, z = %.1f\n", x, y, z);

    return 0; // จบโปรแกรม
}