#include <stdio.h>

int main() { // จุดเริ่มต้นของโปรแกรม
    // ประกาศตัวแปร กำหนดค่าเริ่มต้น
    int i = 1, j = 2, k; 
    // แสดงค่าตัวแปรเริ่มต้น
    printf("i = %d,  j = %d, k = %d\n", i, j, k);

    k = i + j; // คำนวณค่า k จาก i + j = 1 + 2 = 3
    printf("i = %d,  j = %d, k = %d\n", i, j, k);

    i = i+(k*j); // คำนวณค่า i ใหม่: i = 1 + (3 * 2) = 1 + 6 = 7
    printf("i = %d,  j = %d, k = %d\n", i, j, k);

    j = i / 2; // คำนวณค่า j ใหม่: j = 7 / 2 = 3 (หารจำนวนเต็ม)
    printf("i = %d,  j = %d, k = %d\n", i, j, k);

    k = i % 2; // คำนวณค่า k ใหม่: k = 7 % 2 = 1 (หารเอาเศษ)
    printf("i = %d,  j = %d, k = %d\n", i, j, k);

    i = (k + j)*3; // คำนวณค่า i ใหม่: i = (1 + 3) * 3 = 4 * 3 = 12
    printf("i = %d, j = %d, k = %d\n", i, j, k);

    return 0; // จบโปรแกรม

}